{
    "principal": {
        "name": "Cleidiane Da Rosa Eloy"
    },
    "contact": {
        "email": "cleidianeloy@hotmail.com",
        "linkedin": "https://www.linkedin.com/in/cleidiane-eloy/",
        "instagram": "https://www.instagram.com/cleidianeloy/",
        "github": "https://github.com/cleidianeloy",
        "phone": "+5548999000100"
    },
    "curriculo": {
        "occupation": "Desenvolvedora Front-End",
        "about":{
            "title":"Sobre Mim", 
            "elements": [{
                "desc": " Sou apaixonada por tecnologia com sólido conhecimento em Javascript, HTML, CSS e JQuery. Experiência em desenvolvimento web, incluindo React, NodeJS e consumo de APIs, com projetos práticos demonstrados no Github. Aplico os princípios de Clean Architecture em meus projetos, buscando um código mais organizado, testável e de fácil manutenção. Atualmente, contribuo para o SENAI, renomada instituição de educação brasileira, desenvolvendo materiais didáticos para diversos níveis de ensino. Engajada com a acessibilidade web, participo do movimento \"Web para Todos\"."
            }]},
        "career": { 
            "title":"Carreira",
            "elements":[
                {
                    "occupation": " Programador Web Pleno",
                    "company":"SENAI",
                    "start": "2021-06",
                    "end": null,
                    "desc": "Meu trabalho é produzir cursos a distância em SCORM para LMS utilizando HTML, CSS, Jquery, Javascript. A tarefa inclui pegar um conteúdo feito por um professor e incluir em páginas web onde o estudante tem acesso. Além disso, aproveito para desenvolver novos recursos como slider, atividades interativas, reprodutores de áudio, entre outros. Para gerenciar meu trabalho, tenho utilizado o Trello como organizador de tarefas e o GitLab como reposítorio. " 
                },
                {
                    "occupation": "Junior Developer",
                    "company":"NTT Data",
                    "start": "2021-01",
                    "end": "2021-05",
                    "desc": "Como programador júnior, adquiri experiência em PL/SQL, atuando como suporte nível 3. Nessa função, resolvi problemas complexos de clientes, analisando o banco de dados e desenvolvendo soluções em PL/SQL, Shellscript e Java. Trabalhando em equipe, automatizei e documentei processos, como também contribuí para a melhoria dos serviços prestados." 
                }
            ]},
        "education": { 
            "title": "Formação Acadêmica",
            "elements": [ 
                {
            "topic": "Inglês com foco em conversação",
            "institution": "Times Idiomas",
            "start":"2022-01",
            "end": "2023-06"
                },
                {
                "topic": "Gestão em Tecnologia da Informação",
                "institution": "Uniasselvi",
                "start":"2018-08",
                "end": "2021-01"
                },
                {
                "topic": "Desenvolvimento de Sistemas",
                "institution": "IFSC",
                "start":"2019-08",
                "end": "2021-04"
                }  
        ]},
        "extras": {
            "title":"Aprendizado Contínuo",
            "elements": [
                { 
                    "title": "Trabalho Voluntário",
                    "institution": "PAQ", 
                    "start": "2025-01",
                    "end": null,
                    "desc":"Atuo como mentora trabalhando com jovens com o objetivo de ajudá-los a entrar no mercado da tecnologia"},
                {  
                    "title": "Trabalho Voluntário",
                    "institution": "Web Para Todos", 
                    "start": "2022-08",
                    "end": null,
                    "desc":" Presto regulamente serviços voluntários ao Movimento Web para Todos e, com isso, contribuo ativamente para a transformação da web brasileira num ambiente muito mais justo, inclusivo e acessível a todas as pessoas."}
        ]}
    },
    "resume": {
        "occupation": "Front-End Developer",
        "about": {
            "title": "About", 
            "elements": [{ 
                "desc": "I'm passionate about technology, with a strong knowledge of Javascript, HTML, CSS, and JQuery. I have web development experience applying Clean Architecture using React, NodeJS, and API consumption. Currently, I've been working at Senai, a renowned Brazilian education company, developing SCORMs for Learning Management Systems. I'm contributing to web accessibility at the organization Web Para Todos (Web to Everyone). Also, I've been working voluntarily at Prototipando a Quebrada (Prototyping the Hood) as a mentor."
            }]
        },
        "carrer": {
            "title": "Career",
            "elements": [
                {
                    "occupation": "Pleno Web Developer",
                    "company":"SENAI",
                    "start": "2021-06",
                    "end": null,
                    "desc": "The task in this experience is developing learning distance coursesusing HTML, CSS, JQuery, and Javascript, JSON packing as a SCORM to run in LMSs, and saving at GitLab. I used to develop recourses like sliders, interactive exercises, audio players, and others. We already adapted our code to use React as a framework. We use Agile Methodology, doing sprints, using Trello (Kanban)." 
                },
                {
                    "occupation": "Junior Developer",
                    "company":"NTT Data",
                    "start": "2021-01",
                    "end": "2021-05",
                    "desc": "As a Junior Developer,  I got experience analyzing databases anddeveloping solutions using PL/SQL, ShellScript, and Java. So I could offer proper resolutions to complex client problems in level 3 support. Working with teamwork, I helped to automate and document processes, contributing to improving support services. " 
                }
            ]
        },
        "education": {
            "title" :"Education",
            "elements":[ 
                    {
                    "topic": "Conversational English",
                    "institution": "Times Idiomas",
                    "start":"2022-01",
                    "end": "2023-06"
                    },
                    {
                        "topic": " Information Technology Management.",
                        "institution": "Uniasselvi",
                        "start":"2018-08",
                        "end": "2021-01"
                    },
                    {
                        "topic": "Systems Development",
                        "institution": "IFSC",
                        "start":"2019-08",
                        "end": "2021-04"
                    }
            
            ]},
        "extras": {
            "title": " Ongoing learning",
            "elements":[
                { 
                    "title": "Voluntary Work",
                    "institution": "PAQ", 
                    "start": "2025-01",
                    "end": null,
                    "desc":"I've been working voluntarily at Prototipando a Quebrada (Prototyping the Hood) organization, as a mentor for a young student starting her studies in Information Technology."},
                {  
                    "title": "Voluntary Work",
                    "institution": "Web Para Todos", 
                    "start": "2022",
                    "end": null,
                    "desc":"I regularly volunteer for the Web Para Todos (Web to Everyone) movement and, through this, actively contribute to transforming the Brazilian web into a much fairer, inclusive, and accessible environment for all."}
                ]}
    }

}